# 🧨 Задание 1:
# Выведи на экран фразу:
# Привет, Python! Я не боюсь тебя.

print('Привет, Python! Я не боюсь тебя.')

# 🧨 Задание 2:
# Создай две переменные a и b, присвой им значения 5 и 10. Выведи на экран их сумму.

a = 5
b = 10

print(f'Сумма: {a + b}')

# 🧨 Задание 3:
# Пусть у тебя есть переменная name, в которую пользователь вводит своё имя. Выведи фразу:

# Привет, <имя пользователя>!
# (используй input())

user_name = input('Введите имя пользователя: ')

print(f'Привет, {user_name}')

# 🧨 Задание 4:
# Создай переменную age, в которую вводится возраст. Увеличь возраст на 10 и выведи результат.
# Пусть человек почувствует себя старым уже сейчас!

age = int(input('Введите возрст: '))

new_age = age + 10

print(new_age)