# Задача 1. Шифр Цезаря 2
# Мы уже писали программу, которая шифрует строку с помощью шифра Цезаря. 
# Напомним, что в таком способе шифрования каждая буква заменяется на следующую по алфавиту через K позиций по кругу.

# Напишите (модифицируйте) программу, которая реализует этот алгоритм шифрования. 
# Не используйте конкатенацию и сделайте так, чтобы текст был в одном регистре.



# Задача 2. Путь к файлу
# Все данные сайта лежат в одном проекте. При написании кода, внутри этого проекта часто используются абсолютные пути файлов,
# которые необходимо проверять.

# Пользователь вводит абсолютный путь к текстовому файлу, а также проверяемые данные: диск и расширение файла. Напишите программу, 
# которая проверяет корректность этого пути.

 

# Пример:

# Путь к файлу: C:/user/docs/folder/new_file.txt

# На каком диске должен лежать файл: C

# Требуемое расширение файла: .txt

# Путь корректен!



# Задача 3. Удаление части
# На вход в программу подаётся строка, состоящая из заглавных и строчных букв кириллицы.
#  Напишите код, который проверяет, каких букв в строке больше: строчных или заглавных.
# Если заглавных букв больше, то сделайте все буквы строки заглавными, иначе сделайте всё строчными.

# Подсказка: используйте методы islower() и/или isupper().


# Пример:
# Введите строку: ПитоН - этО хорошО
# Результат: питон - это хорошо

# Пример 2:
# Введите строку: ПиТоН - ЭтО УДоБнО
# Результат: ПИТОН - ЭТО УДОБНО

